In [14]:
import pandas as pd

In [15]:
data = {
    'Name': ['Amit', 'Neha', 'Rahul', 'Priya', 'Karan','Amit'],
    'Age': [22, 24, 23, 21, 25,22],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male','Male'],
    'Score': [88, 92, 79, 95, 76,88]
}

df=pd.DataFrame(data)
df

    Name  Age  Gender  Score
0   Amit   22    Male     88
1   Neha   24  Female     92
2  Rahul   23    Male     79
3  Priya   21  Female     95
4  Karan   25    Male     76
5   Amit   22    Male     88

In [16]:
print(df.head(3))

    Name  Age  Gender  Score
0   Amit   22    Male     88
1   Neha   24  Female     92
2  Rahul   23    Male     79

In [17]:
print(df.tail(3))

    Name  Age  Gender  Score
3  Priya   21  Female     95
4  Karan   25    Male     76
5   Amit   22    Male     88

In [18]:
print(df.index)
print(df.columns)
print(df.shape)

RangeIndex(start=0, stop=6, step=1)
Index(['Name', 'Age', 'Gender', 'Score'], dtype='object')
(6, 4)

In [19]:
print(df.value_counts())

Name   Age  Gender  Score
Amit   22   Male    88       2
Karan  25   Male    76       1
Neha   24   Female  92       1
Priya  21   Female  95       1
Rahul  23   Male    79       1
Name: count, dtype: int64

In [26]:
df['Gender'].value_counts()

Gender
Male      4
Female    2
Name: count, dtype: int64

In [27]:
df[df['Gender']=="Male"]

    Name  Age Gender  Score
0   Amit   22   Male     88
2  Rahul   23   Male     79
4  Karan   25   Male     76
5   Amit   22   Male     88

In [24]:
df[df['Gender']=="Male"]["Gender"].value_counts()

Gender
Male    4
Name: count, dtype: int64

In [28]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [29]:
#number of unique values / catagirious
df['Gender'].nunique()     # Output: 2

2